# 02. Analysis Seoul Crime

### 1. 프로젝트 개요

### 2. 데이터 개요

In [1]:
import pandas as pd
import numpy as np

In [6]:
crime_raw_data = pd.read_csv("../data/02. crime_in_Seoul.csv", thousands=",", encoding="euc-kr")
crime_raw_data

        구분   죄종 발생검거     건수
0       중부   살인   발생    2.0
1       중부   살인   검거    2.0
2       중부   강도   발생    3.0
3       중부   강도   검거    3.0
4       중부   강간   발생  141.0
...    ...  ...  ...    ...
65529  NaN  NaN  NaN    NaN
65530  NaN  NaN  NaN    NaN
65531  NaN  NaN  NaN    NaN
65532  NaN  NaN  NaN    NaN
65533  NaN  NaN  NaN    NaN

[65534 rows x 4 columns]

In [9]:
crime_raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65534 entries, 0 to 65533
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   구분      310 non-null    object
 1   죄종      310 non-null    object
 2   발생검거    310 non-null    object
 3   건수      310 non-null    float64
dtypes: float64(1), object(3)
memory usage: 2.0+ MB

In [11]:
crime_raw_data["죄종"].uniqueque()

array(['살인', '강도', '강간', '절도', '폭력', nan], dtype=object)

In [12]:
crime_raw_data[crime_raw_data.isnull()].tail()

        구분   죄종 발생검거  건수
65529  NaN  NaN  NaN NaN
65530  NaN  NaN  NaN NaN
65531  NaN  NaN  NaN NaN
65532  NaN  NaN  NaN NaN
65533  NaN  NaN  NaN NaN

In [16]:
crime_raw_data = crime_raw_data[crime_raw_data["죄종"].notnull()]
crime_raw_data

     구분  죄종 발생검거      건수
0    중부  살인   발생     2.0
1    중부  살인   검거     2.0
2    중부  강도   발생     3.0
3    중부  강도   검거     3.0
4    중부  강간   발생   141.0
..   ..  ..  ...     ...
305  수서  강간   검거   144.0
306  수서  절도   발생  1149.0
307  수서  절도   검거   789.0
308  수서  폭력   발생  1666.0
309  수서  폭력   검거  1431.0

[310 rows x 4 columns]

In [17]:
crime_raw_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 310 entries, 0 to 309
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   구분      310 non-null    object
 1   죄종      310 non-null    object
 2   발생검거    310 non-null    object
 3   건수      310 non-null    float64
dtypes: float64(1), object(3)
memory usage: 12.1+ KB

In [18]:
crime_raw_data.tail()

     구분  죄종 발생검거      건수
305  수서  강간   검거   144.0
306  수서  절도   발생  1149.0
307  수서  절도   검거   789.0
308  수서  폭력   발생  1666.0
309  수서  폭력   검거  1431.0

In [19]:
crime_raw_data["구분"].unique()

array(['중부', '종로', '남대문', '서대문', '혜화', '용산', '성북', '동대문', '마포', '영등포',
       '성동', '동작', '광진', '서부', '강북', '금천', '중랑', '강남', '관악', '강서', '강동',
       '종암', '구로', '서초', '양천', '송파', '노원', '방배', '은평', '도봉', '수서'],
      dtype=object)

## pandas pivot table
- index, columns, values, aggfunc

In [23]:
df = pd.read_excel("../data/02. sales-funnel.xlsx")
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [24]:
df["Name"].unique()

array(['Trantow-Barrows', 'Fritsch, Russel and Anderson', 'Kiehn-Spinka',
       'Kulas Inc', 'Jerde-Hilpert', 'Barton LLC', 'Herman LLC',
       'Purdy-Kunde', 'Stokes LLC', 'Kassulke, Ondricka and Metz',
       'Keeling LLC', 'Koepp Ltd'], dtype=object)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Account   17 non-null     int64
 1   Name      17 non-null     object
 2   Rep       17 non-null     object
 3   Manager   17 non-null     object
 4   Product   17 non-null     object
 5   Quantity  17 non-null     int64
 6   Price     17 non-null     int64
 7   Status    17 non-null     object
dtypes: int64(3), object(5)
memory usage: 1.2+ KB

In [26]:
df["Rep"].unique()

array(['Craig Booker', 'Daniel Hilton', 'John Smith', 'Cedric Moss',
       'Wendy Yule'], dtype=object)

#### index 설정

In [27]:
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [29]:
# Name컬럼을 index로 설정
pd.pivot_table(df, index="Name")

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000  1.000000
Fritsch, Russel and Anderson   737550   35000  1.000000
Herman LLC                     141962   65000  2.000000
Jerde-Hilpert                  412290    5000  2.000000
Kassulke, Ondricka and Metz    307599    7000  3.000000
Keeling LLC                    688981  100000  5.000000
Kiehn-Spinka                   146832   65000  2.000000
Koepp Ltd                      729833   35000  2.000000
Kulas Inc                      218895   25000  1.500000
Purdy-Kunde                    163416   30000  1.000000
Stokes LLC                     239344    7500  1.000000
Trantow-Barrows                714466   15000  1.333333

In [31]:
# 멀티 인덱스 설정
df.pivot_table(index=["Name", "Rep", "Manager"]).head()

,,,Account,Price,Quantity
Name,Rep,Manager,,,
Barton LLC,John Smith,Debra Henley,740150,35000,1.0
"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,737550,35000,1.0
Herman LLC,Cedric Moss,Fred Anderson,141962,65000,2.0
Jerde-Hilpert,John Smith,Debra Henley,412290,5000,2.0
"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,307599,7000,3.0

#### values 설정

In [32]:
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [33]:
# values의 기본 값은 중복 되는 값들의 평균값
df.pivot_table(index=["Manager", "Rep"], values="Price")

                                    Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000
              Daniel Hilton  38333.333333
              John Smith     20000.000000
Fred Anderson Cedric Moss    27500.000000
              Wendy Yule     44250.000000

In [35]:
# values를 평균값이 아닌 sum, max, min 등의 함수를 적용하여 출력할 때
df.pivot_table(index=["Manager", "Rep"], values="Price", aggfunc=np.sum)

                              Price
Manager       Rep
Debra Henley  Craig Booker    80000
              Daniel Hilton  115000
              John Smith      40000
Fred Anderson Cedric Moss    110000
              Wendy Yule     177000

In [36]:
df.pivot_table(index=["Manager", "Rep"], values="Price", aggfunc=np.min)

                             Price
Manager       Rep
Debra Henley  Craig Booker    5000
              Daniel Hilton  10000
              John Smith      5000
Fred Anderson Cedric Moss     5000
              Wendy Yule      5000

In [37]:
df.pivot_table(index=["Manager", "Rep"], values="Price", aggfunc=np.max)

                              Price
Manager       Rep
Debra Henley  Craig Booker    35000
              Daniel Hilton   65000
              John Smith      35000
Fred Anderson Cedric Moss     65000
              Wendy Yule     100000

In [38]:
# values에 sum 등의 여러 함수를 적용하여 출력할 때
df.pivot_table(index=["Manager", "Rep"], values="Price", aggfunc=[np.sum, np.max, np.min, np.mean, len])

                                sum    amax   amin          mean   len
                              Price   Price  Price         Price Price
Manager       Rep
Debra Henley  Craig Booker    80000   35000   5000  20000.000000     4
              Daniel Hilton  115000   65000  10000  38333.333333     3
              John Smith      40000   35000   5000  20000.000000     2
Fred Anderson Cedric Moss    110000   65000   5000  27500.000000     4
              Wendy Yule     177000  100000   5000  44250.000000     4

#### columns 설정

In [42]:
df.pivot_table(index=["Manager", "Rep"], values="Price", columns="Product",  aggfunc=np.sum)

Product                           CPU  Maintenance  Monitor  Software
Manager       Rep
Debra Henley  Craig Booker    65000.0       5000.0      NaN   10000.0
              Daniel Hilton  105000.0          NaN      NaN   10000.0
              John Smith      35000.0       5000.0      NaN       NaN
Fred Anderson Cedric Moss     95000.0       5000.0      NaN   10000.0
              Wendy Yule     165000.0       7000.0   5000.0       NaN

In [44]:
# columns 설정에서 NaN 값을 0으로 변경
df.pivot_table(index=["Manager", "Rep"], values="Price", columns="Product",  aggfunc=np.sum, fill_value=0)

Product                         CPU  Maintenance  Monitor  Software
Manager       Rep
Debra Henley  Craig Booker    65000         5000        0     10000
              Daniel Hilton  105000            0        0     10000
              John Smith      35000         5000        0         0
Fred Anderson Cedric Moss     95000         5000        0     10000
              Wendy Yule     165000         7000     5000         0

In [45]:
# 2개 이상 index, values 설정
df.pivot_table(index=["Manager", "Rep", "Product"], values=["Price", "Quantity"], aggfunc=np.sum, fill_value=0)

                                          Price  Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000         2
                            Maintenance    5000         2
                            Software      10000         1
              Daniel Hilton CPU          105000         4
                            Software      10000         1
              John Smith    CPU           35000         1
                            Maintenance    5000         2
Fred Anderson Cedric Moss   CPU           95000         3
                            Maintenance    5000         1
                            Software      10000         1
              Wendy Yule    CPU          165000         7
                            Maintenance    7000         3
                            Monitor        5000         2

In [46]:
# aggfunc 2개 이상 설정
df.pivot_table(
    index=["Manager", "Rep", "Product"], 
    values=["Price", "Quantity"], 
    aggfunc=[np.sum, np.min, np.max, np.mean], 
    fill_value=0)

                                            sum            amin           \
                                          Price Quantity  Price Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000        2  30000        1
                            Maintenance    5000        2   5000        2
                            Software      10000        1  10000        1
              Daniel Hilton CPU          105000        4  40000        2
                            Software      10000        1  10000        1
              John Smith    CPU           35000        1  35000        1
                            Maintenance    5000        2   5000        2
Fred Anderson Cedric Moss   CPU           95000        3  30000        1
                            Maintenance    5000        1   5000        1
                            Software      10000        1  10000        1
              Wendy Yule    CPU          165000        7  65000        2
                            Maintenance    7000        3   7000        3
                            Monitor        5000        2   5000        2

                                           amax            mean
                                          Price Quantity  Price Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           35000        1  32500      1.0
                            Maintenance    5000        2   5000      2.0
                            Software      10000        1  10000      1.0
              Daniel Hilton CPU           65000        2  52500      2.0
                            Software      10000        1  10000      1.0
              John Smith    CPU           35000        1  35000      1.0
                            Maintenance    5000        2   5000      2.0
Fred Anderson Cedric Moss   CPU           65000        2  47500      1.5
                            Maintenance    5000        1   5000      1.0
                            Software      10000        1  10000      1.0
              Wendy Yule    CPU          100000        5  82500      3.5
                            Maintenance    7000        3   7000      3.0
                            Monitor        5000        2   5000      2.0

In [48]:
# margin 값 설정
# margin : 열마다 전체 SUM 값
df.pivot_table(
    index=["Manager", "Rep", "Product"], 
    values=["Price", "Quantity"], 
    aggfunc=[np.sum, np.min, np.max, np.mean], 
    fill_value=0,
    margins=True
)

                                            sum            amin           \
                                          Price Quantity  Price Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000        2  30000        1
                            Maintenance    5000        2   5000        2
                            Software      10000        1  10000        1
              Daniel Hilton CPU          105000        4  40000        2
                            Software      10000        1  10000        1
              John Smith    CPU           35000        1  35000        1
                            Maintenance    5000        2   5000        2
Fred Anderson Cedric Moss   CPU           95000        3  30000        1
                            Maintenance    5000        1   5000        1
                            Software      10000        1  10000        1
              Wendy Yule    CPU          165000        7  65000        2
                            Maintenance    7000        3   7000        3
                            Monitor        5000        2   5000        2
All                                      522000       30   5000        1

                                           amax                   mean  \
                                          Price Quantity         Price
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           35000        1  32500.000000
                            Maintenance    5000        2   5000.000000
                            Software      10000        1  10000.000000
              Daniel Hilton CPU           65000        2  52500.000000
                            Software      10000        1  10000.000000
              John Smith    CPU           35000        1  35000.000000
                            Maintenance    5000        2   5000.000000
Fred Anderson Cedric Moss   CPU           65000        2  47500.000000
                            Maintenance    5000        1   5000.000000
                            Software      10000        1  10000.000000
              Wendy Yule    CPU          100000        5  82500.000000
                            Maintenance    7000        3   7000.000000
                            Monitor        5000        2   5000.000000
All                                      100000        5  30705.882353


                                         Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU          1.000000
                            Maintenance  2.000000
                            Software     1.000000
              Daniel Hilton CPU          2.000000
                            Software     1.000000
              John Smith    CPU          1.000000
                            Maintenance  2.000000
Fred Anderson Cedric Moss   CPU          1.500000
                            Maintenance  1.000000
                            Software     1.000000
              Wendy Yule    CPU          3.500000
                            Maintenance  3.000000
                            Monitor      2.000000
All                                      1.764706

---

## 3. 서울시 범죄 현황 데이터 정리

In [54]:
crime_raw_data.head()

   구분  죄종 발생검거     건수
0  중부  살인   발생    2.0
1  중부  살인   검거    2.0
2  중부  강도   발생    3.0
3  중부  강도   검거    3.0
4  중부  강간   발생  141.0

In [68]:
crime_station = crime_raw_data.pivot_table(
    index=["구분"],
    columns=["죄종", "발생검거"],
    aggfunc=[np.sum]
)
crime_station.head()

        sum
         건수
죄종       강간           강도          살인           절도              폭력
발생검거     검거     발생    검거    발생    검거   발생      검거      발생      검거      발생
구분
강남    269.0  339.0  26.0  24.0   3.0  3.0  1129.0  2438.0  2096.0  2336.0
강동    152.0  160.0  13.0  14.0   5.0  4.0   902.0  1754.0  2201.0  2530.0
강북    159.0  217.0   4.0   5.0   6.0  7.0   672.0  1222.0  2482.0  2778.0
강서    239.0  275.0  10.0  10.0  10.0  9.0  1070.0  1952.0  2768.0  3204.0
관악    264.0  322.0  10.0  12.0   7.0  6.0   937.0  2103.0  2707.0  3235.0

In [69]:
crime_station.columns # 멀티인덱스

MultiIndex([('sum', '건수', '강간', '검거'),
            ('sum', '건수', '강간', '발생'),
            ('sum', '건수', '강도', '검거'),
            ('sum', '건수', '강도', '발생'),
            ('sum', '건수', '살인', '검거'),
            ('sum', '건수', '살인', '발생'),
            ('sum', '건수', '절도', '검거'),
            ('sum', '건수', '절도', '발생'),
            ('sum', '건수', '폭력', '검거'),
            ('sum', '건수', '폭력', '발생')],
           names=[None, None, '죄종', '발생검거'])

In [70]:
crime_station['sum', '건수', '강간', '검거'][:5]

구분
강남    269.0
강동    152.0
강북    159.0
강서    239.0
관악    264.0
Name: (sum, 건수, 강간, 검거), dtype: float64

In [71]:
# 컬럼 레벨 조정
crime_station.columns = crime_station.columns.droplevel([0,1])

In [72]:
crime_station.columns

MultiIndex([('강간', '검거'),
            ('강간', '발생'),
            ('강도', '검거'),
            ('강도', '발생'),
            ('살인', '검거'),
            ('살인', '발생'),
            ('절도', '검거'),
            ('절도', '발생'),
            ('폭력', '검거'),
            ('폭력', '발생')],
           names=['죄종', '발생검거'])

In [73]:
crime_station.tail()

죄종       강간           강도         살인           절도              폭력
발생검거     검거     발생    검거    발생   검거   발생      검거      발생      검거      발생
구분
종로    113.0  137.0   3.0   6.0  0.0  4.0   389.0   952.0  1135.0  1291.0
종암     42.0   51.0   5.0   5.0  1.0  2.0   344.0   680.0   815.0   932.0
중랑    150.0  164.0  14.0  14.0  7.0  8.0  1052.0  1691.0  2712.0  3164.0
중부     96.0  141.0   3.0   3.0  2.0  2.0   485.0  1204.0  1164.0  1335.0
혜화     64.0  101.0   6.0   6.0  2.0  2.0   379.0   988.0   842.0   972.0

In [74]:
crime_station.index

Index(['강남', '강동', '강북', '강서', '관악', '광진', '구로', '금천', '남대문', '노원', '도봉',
       '동대문', '동작', '마포', '방배', '서대문', '서부', '서초', '성동', '성북', '송파', '수서',
       '양천', '영등포', '용산', '은평', '종로', '종암', '중랑', '중부', '혜화'],
      dtype='object', name='구분')

In [75]:
get_ipython("pip list")

TypeError: get_ipython() takes 1 positional argument but 2 were given